blog/2021/09/01/query-engine-resources/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>query-engine-resources - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="&lt;TODO: insert your keywords here&gt;" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>query-engine-resources</h1>
            <p>
Various articles on query planning and execution that look interesting. I have not read them all.
</p>

<ul class="org-ul">
<li>Volcano-An Extensible and Parallel Query Evaluation System</li>
</ul>
<p>
<a href="https://www.pgcon.org/2016/schedule/attachments/425_PGCon-Lessons-in-Building-Distributed-Query-Planner.pdf">https://www.pgcon.org/2016/schedule/attachments/425_PGCon-Lessons-in-Building-Distributed-Query-Planner.pdf</a>
<a href="https://github.com/uwescience/raco">https://github.com/uwescience/raco</a>
<a href="https://spark.apache.org/docs/latest/submitting-applications.html">https://spark.apache.org/docs/latest/submitting-applications.html</a>
<a href="https://www.sciencedirect.com/science/article/pii/S1877050915013575">https://www.sciencedirect.com/science/article/pii/S1877050915013575</a>
<a href="http://optique-project.eu/wp-content/uploads/2014/11/D7.2.pdf">http://optique-project.eu/wp-content/uploads/2014/11/D7.2.pdf</a>
<a href="https://blogs.msdn.microsoft.com/craigfr/2006/09/20/hash-aggregate/">https://blogs.msdn.microsoft.com/craigfr/2006/09/20/hash-aggregate/</a>
</p>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2021-09-01</span>
        <span title="last modification date" class="post-info">2021-09-01</span>
        <span title="tags" class="post-info"><a href="/tags/&lt;todo/">&lt;TODO</a>, <a href="/tags/insert-your-tags-here&gt;/">insert your tags here&gt;</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
